[

  {
    "title": "Bilito",
    "description": "Application to share the bill of a restaurant/bar easily between several people to know who pays what.",
    "url": "https://bilito.fun",
    "github": "",
    "isTeamWork": true,
    "teamText": "It was developed in collaboration with  an expert in data science. I was in charge of the full front-end development, the CORS configuration in the backend and all of the infrastructure settings.",
    "stack": ["React",  "CSS", "Typescript",  "Postgres", "Python",   "Dokku", "CloudFlare"],
    "longDescription": {
      "frontend": "This project has been developed using React with Typescript. Application is designed to be used in a mobile phone. Includes websockets connection to update shared data in real time.",
      "backend": "The back-end has been developed using Python, specifically Fast-API. To achieve the main funcionality, processing the receipt image, we used a combination of Open AI and Google API.",
      "database": "The database used is Postgres. I used a Dokku app to create the database.",
      "deployment": "The application is deployed in a personal VPS with Ubuntu distribution. I used Dokku as orchestration tool and CloudFare as CDN. The domain is managed by CloudFare."
    }
  },
  {
    "title": "Smart swapper",
    "description": "Decentralized finance dapp to swap tokens in Binance Smart Chain through Paraswap aggregator. This permits select the best path for each route getting the best results.",
    "url": "https://smart-swapper.netlify.app/",
    "github": "https://github.com/javirro/paraswap",
    "isTeamWork": false,
    "teamText": "This project was developed by myself. It is an example of how  to build a simple but useful Dapp. At this moment it is only valid for Binance Smart chain but in the future it would  be multichain.",
    "stack": ["React", "CSS", "Typescript",  "Web3.js", "EIP6963", "Paraswap API"],
    "longDescription": {
      "frontend": "This project has been developed using React with Typescript. To interact to blockchain network it used web3.js and the wallets  connection is based on EIP-6963 which permits detect several browser wallet at the same time. The application is fully responsive.",
      "backend": "The dapp has not a backend. The front-end interacts directly with Paraswap API to get the best route for the swap and send the generated swap data to the Paraswap smart contract.",
      "database": "This project does not have a database.",
      "deployment": "The front-end is deployed in Netlify platform."
    }
  }
]