[
  {
    "title": "Boosthub",
    "description": "Platform to offer blockchain courses and  mentoring services related to development",
    "url": "https://0xboosthub.com",
    "github": "",
    "stack": ["React", "Node.js", "CSS", "Typescript", "Postgres", "Ethers.js", "Docker", "Dokku", "CloudFare"],
    "isTeamWork": true,
    "teamText": "It was developed in collaboration with an expert in blockchain. I was in charge of the full front-end, almost all  the back-end and all of the infrastructure settings.",
    "longDescription": {
      "frontend": "This project has been fully developed using React with Javascript. Application is fully responsive.",
      "backend": "The back-end has been developed using Node.js with Typescript. ",
      "database": "The database used is Postgres. For local development, I used a Postgres docker container. For production, I used a Dokku app to create the database.",
      "deployment": "The application is deployed in a personal VPS with Ubuntu distribution. I used Dokku as orchestration tool and CloudFare as CDN. The domain is managed by CloudFare.",
      "blockchain": "The application uses Ethers.js to interact with the Arbitrum blockchain. The application permits minting a  NFT certifacte in the blockchain when a course is finished."
    }

  },
  {
    "title": "Fast ticket",
    "description": "Application to share the ticket of a restaurant/bar easily between several people",
    "url": "https://foodie-easypay.store",
    "github": "",
    "isTeamWork": true,
    "teamText": "It was developed in collaboration with  an expert in data science. I was in charge of the full front-end development, the CORS configuration in the backend and all of the infrastructure settings.",
    "stack": ["React", "Python", "CSS", "Typescript", "Postgres",  "Dokku", "CloudFare"],
    "longDescription": {
      "frontend": "This project has been developed using React with Typescript. Application is designed to be used in a mobile phone.",
      "backend": "The back-end has been developed using Python, specifically Fast-API. The backed used an API for an enterprise called Mindee which performs an OCR to the restaurant receipts.",
      "database": "The database used is Postgres. I used a Dokku app to create the database.",
      "deployment": "The application is deployed in a personal VPS with Ubuntu distribution. I used Dokku as orchestration tool and CloudFare as CDN. The domain is managed by CloudFare."
    }
  },
  {
    "title": "Smart swapper",
    "description": "Dapp to swap tokens in Binance Smart Chain through Paraswap aggregator. This permits select the best path for each route getting the best results.",
    "url": "https://smart-swapper.netlify.app/",
    "github": "https://github.com/javirro/paraswap",
    "isTeamWork": false,
    "teamText": "This project was developed by myself. It is an example of how  to build a simple but useful Dapp. At this moment it is only valid for Binance Smart chain but in the future it wwould  be multichain.",
    "stack": ["React", "CSS", "Typescript",  "Web3.js", "EIP6963", "Paraswap API"],
    "longDescription": {
      "frontend": "This project has been developed using React with Typescript. To interact to blockchain network it used web3.js and the wallets  connection is based on EIP-6963 which permits detect several browser wallet at the same time. The application is fully responsive.",
      "backend": "The dapp has not a backend. The front-end interacts directly with Paraswap API to get the best route for the swap and send the generated swap data to the Paraswap smart contract.",
      "database": "This project does not have a database.",
      "deployment": "The front-end is deployed in Netlify platform."
    }
  },
  {
    "title": "Food ranking",
    "description": "Application to rank food depending on my personal criteria.",
    "url": "https://food-ranking.netlify.app",
    "github": "",
    "isTeamWork": false,
    "teamText": "This project was developed by myself. It was one of my first full-stack project. ",
    "stack": ["React", "Node", "CSS", "Typescript", "Postgres",  "Microsoft Azure", "Serverless functions"],
    "longDescription": {
      "frontend": "This project has been developed using React with Typescript. The application is fully responsive.",
      "backend": "The back-end has been developed using Node.js with Typescript. It is deployed using serverless functions provided by Microsoft Azure.",
      "database": "The database used is Postgres. I used an external provider to get Postgres database services.",
      "deployment": "The front-end is deployed in Netlify platform and the back-end in the serverless services provided by Microsoft Azure."
    }
  }
]