[
    {
    "company": "Metlabs",
    "title": "Tech Lead",
    "description": "Working in small services company leading a  6-7 members team",
    "startDate": "February 2025",
    "endDate": "Current",
    "fullTime": true,
    "rol": [
      "Working as a Tech Lead in a team of 6–7 members. Responsible for team management, technical decision-making, implementing new features, and reviewing code from junior developers.",
      "I serve as the main link between the development team, project manager, and clients to facilitate continuous feedback on product iterations, ensuring time efficiency and alignment across all parties.",
      "Actively contribute to development, with a strong focus on backend logic and complex problem-solving, alongside team leadership duties."
    ],
    "techStack": ["React", "Node", "Typescript", "Tailwind", "Solidity", "Postgres", "Github", "Docker", "Dokku"]
  },
  {
    "company": "Glue Digital",
    "title": "Full stack and web3 developer",
    "description": "Working in DEFI (Decentralized finance) startup as full stack developer",
    "startDate": "February 2022",
    "endDate": "February 2025",
    "fullTime": true,
    "rol": [
      "Developing the company’s core product, contributing to both frontend and backend as needed. Leading a team of 3 developers and working closely with the CTO to ensure code quality and alignment with product goals.",
      "Using Scrum to manage project evolution. Serve as the main liaison between development, product, design, and marketing teams to ensure efficient feedback loops and time-effective delivery.",
      "Tackled complex technical challenges such as real-time communication with WebSockets, large-scale async request handling, responsive design implementation, global state management with Redux, and performance optimization for large datasets."
    ],
    "techStack": ["React", "Node", "Typescript", "Sass", "Solidity", "Postgres", "Gitlab", "Docker", "Dokku"]
  },
  {
    "company": "Cetim",
    "title": "Advisor and Full stack developer",
    "description": "Advising and developing R&D projects  which includes blochchain in web applications",
    "startDate": "June 2022",
    "endDate": "April 2023",
    "fullTime": false,
    "rol": [
      "Lead a team of the 3 people to develop  R&D projects  which includes blockchain in web applications.",
      "Making technical decisions about the projects.",
      "Deal with clients to understand proyect requirements.",
      "Writing technical documentation for the projects."
    ],
    "techStack": ["React", "Node", "Typescript", "CSS", "Solidity", "Github", "Azure", "Postgres"]
  },
  {
    "company": "Cetim",
    "title": "Full stack and web3 developer",
    "description": "Working in R&D projects which includes blochchain in web applications",
    "startDate": "September 2021",
    "endDate": "February 2022",
    "fullTime": true,
    "rol": [
      "Develop MVP projects mainly based on create a web application which includes blockchain technology.",
      "I was the unique developer in the team, so I was in charge of the full stack development.",
      "Deal with clients to understand proyect requirements.",
      "Writing technical documentation for the projects."
    ],
    "techStack": ["React", "Node", "Typescript", "CSS", "Solidity", "Github", "Azure", "Postgres"]
  },
  {
    "company": "OpenWebinars",
    "title": "Blockchain online courses professor",
    "startDate": "September 2021",
    "endDate": "October 2021",
    "fullTime": false,
    "rol": ["Teaching online courses about blockchain technology", "Creating the course content.", "The courses topic where related to Ethereum and smart contracts programming."]
  },
  {
    "company": "University of Oviedo",
    "title": "Professor",
    "startDate": "October 2019",
    "endDate": "August 2021",
    "fullTime": true,
    "rol": [
      "Teaching in the Degrees of Computer Science Engineering and Telecommunications Engineering.",
      "Giving lectures in English and Spanish (bilingual degrees)."
    ]
  }
]
